-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/ccwang/Documents/LSHTMlearningnote/backupfiles/LSHTMstata.log
  log type:  text
 opened on:  24 Apr 2018, 23:01:40

. 
end of do-file

. do "/tmp/SD09212.000000"

. use pbcbase

. 
end of do-file

. do "/tmp/SD09212.000000"

. tab treat d, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

 Treatment |
(1=placebo |   Outcome (0=alive,
         , |        1=dead)
 2=active) |         0          1 |     Total
-----------+----------------------+----------
         1 |        45         49 |        94 
           |     47.87      52.13 |    100.00 
-----------+----------------------+----------
         2 |        50         47 |        97 
           |     51.55      48.45 |    100.00 
-----------+----------------------+----------
     Total |        95         96 |       191 
           |     49.74      50.26 |    100.00 


. 
end of do-file

. do "/tmp/SD09212.000000"

. table treat d, c(median time)

------------------------------
Treatment |
(1=placeb | Outcome (0=alive, 
o,        |      1=dead)      
2=active) |        0         1
----------+-------------------
        1 | 3.742642  3.000684
        2 | 5.448323  2.201232
------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph, by(treat)
data not st 
r(119);

end of do-file

r(119);

. help stset

. do "/tmp/SD09212.000000"

. stset time, failure(d) 

     failure event:  d != 0 & d < .
obs. time interval:  (0, time]
 exit on or before:  failure

------------------------------------------------------------------------------
        191  total observations
          7  observations end on or before enter()
------------------------------------------------------------------------------
        184  observations remaining, representing
         96  failures in single-record/single-failure data
    747.039  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  11.64408

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph, by(treat)

         failure _d:  d
   analysis time _t:  time

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset dateout, failure(d) origin(datein) scale(365.25)

     failure event:  d != 0 & d < .
obs. time interval:  (origin, dateout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time datein

------------------------------------------------------------------------------
        191  total observations
          7  observations end on or before enter()
------------------------------------------------------------------------------
        184  observations remaining, representing
         96  failures in single-record/single-failure data
    747.012  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  11.64408

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph, by(treat) ci

         failure _d:  d
   analysis time _t:  (dateout-origin)/365.25
             origin:  time datein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts list, by(treat)

         failure _d:  d
   analysis time _t:  (dateout-origin)/365.25
             origin:  time datein

           Beg.          Net            Survivor      Std.
  Time    Total   Fail   Lost           Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
treat=1 
 .0246       90      1      0             0.9889    0.0110     0.9237    0.9984
  .052       89      1      0             0.9778    0.0155     0.9141    0.9944
  .104       88      1      0             0.9667    0.0189     0.9002    0.9891
 .1314       87      1      0             0.9556    0.0217     0.8859    0.9831
 .4107       86      1      0             0.9444    0.0241     0.8717    0.9765
   .46       85      0      1             0.9444    0.0241     0.8717    0.9765
 .6708       84      1      0             0.9332    0.0263     0.8573    0.9694
 .7009       83      1      0             0.9220    0.0283     0.8432    0.9620
 .8268       82      0      1             0.9220    0.0283     0.8432    0.9620
 .9336       81      1      0             0.9106    0.0302     0.8291    0.9543
 .9637       80      0      1             0.9106    0.0302     0.8291    0.9543
 1.081       79      1      0             0.8990    0.0319     0.8149    0.9462
 1.199       78      0      1             0.8990    0.0319     0.8149    0.9462
  1.21       77      1      0             0.8874    0.0336     0.8007    0.9378
 1.248       76      1      0             0.8757    0.0351     0.7867    0.9292
 1.251       75      1      0             0.8640    0.0365     0.7729    0.9204
 1.322       74      1      0             0.8523    0.0379     0.7592    0.9115
 1.429       73      1      0             0.8407    0.0391     0.7457    0.9024
 1.459       72      1      0             0.8290    0.0403     0.7323    0.8932
 1.465       71      1      0             0.8173    0.0413     0.7191    0.8839
 1.582       70      1      0             0.8056    0.0424     0.7060    0.8745
 1.604       69      0      1             0.8056    0.0424     0.7060    0.8745
 1.632       68      0      1             0.8056    0.0424     0.7060    0.8745
 1.996       67      0      1             0.8056    0.0424     0.7060    0.8745
 2.078       66      1      0             0.7934    0.0435     0.6921    0.8646
 2.149       65      0      1             0.7934    0.0435     0.6921    0.8646
 2.286       64      1      0             0.7810    0.0445     0.6782    0.8545
 2.637       63      1      1             0.7686    0.0455     0.6644    0.8442
 2.801       61      1      0             0.7560    0.0465     0.6504    0.8338
 2.804       60      1      0             0.7434    0.0474     0.6365    0.8232
  2.82       59      0      1             0.7434    0.0474     0.6365    0.8232
 2.891       58      1      0             0.7306    0.0483     0.6225    0.8124
 2.902       57      1      0             0.7178    0.0491     0.6085    0.8015
 3.001       56      1      0             0.7050    0.0498     0.5947    0.7904
 3.017       55      0      1             0.7050    0.0498     0.5947    0.7904
  3.05       54      0      1             0.7050    0.0498     0.5947    0.7904
 3.173       53      0      1             0.7050    0.0498     0.5947    0.7904
 3.242       52      0      1             0.7050    0.0498     0.5947    0.7904
 3.255       51      1      0             0.6912    0.0508     0.5796    0.7787
 3.291       50      1      0             0.6773    0.0516     0.5647    0.7668
 3.332       49      1      0             0.6635    0.0524     0.5499    0.7547
 3.337       48      0      1             0.6635    0.0524     0.5499    0.7547
 3.387       47      0      1             0.6635    0.0524     0.5499    0.7547
 3.491       46      0      1             0.6635    0.0524     0.5499    0.7547
 3.655       45      0      1             0.6635    0.0524     0.5499    0.7547
 3.743       44      0      1             0.6635    0.0524     0.5499    0.7547
 4.183       43      1      0             0.6481    0.0534     0.5330    0.7416
 4.271       42      1      0             0.6327    0.0543     0.5163    0.7283
 4.337       41      1      0             0.6172    0.0551     0.4999    0.7148
 4.559       40      1      0             0.6018    0.0558     0.4836    0.7012
 4.616       39      0      1             0.6018    0.0558     0.4836    0.7012
 4.635       38      1      0             0.5860    0.0566     0.4669    0.6872
 4.676       37      0      1             0.5860    0.0566     0.4669    0.6872
 4.775       36      1      0             0.5697    0.0573     0.4499    0.6727
 4.843       35      0      1             0.5697    0.0573     0.4499    0.6727
 4.876       34      1      0             0.5529    0.0580     0.4324    0.6578
 4.936       33      1      0             0.5362    0.0586     0.4152    0.6428
 4.972       32      0      1             0.5362    0.0586     0.4152    0.6428
 4.997       31      1      0             0.5189    0.0592     0.3975    0.6272
 5.147       30      1      0             0.5016    0.0597     0.3800    0.6114
 5.254       29      0      1             0.5016    0.0597     0.3800    0.6114
 5.276       28      1      0             0.4837    0.0602     0.3619    0.5951
 5.311       27      1      0             0.4658    0.0606     0.3441    0.5785
 5.407       26      1      0             0.4478    0.0609     0.3266    0.5618
   5.5       25      0      1             0.4478    0.0609     0.3266    0.5618
 5.602       24      0      2             0.4478    0.0609     0.3266    0.5618
 5.618       22      0      1             0.4478    0.0609     0.3266    0.5618
 5.952       21      0      1             0.4478    0.0609     0.3266    0.5618
 5.977       20      0      1             0.4478    0.0609     0.3266    0.5618
 6.056       19      1      0             0.4243    0.0620     0.3019    0.5413
 6.207       18      1      0             0.4007    0.0629     0.2779    0.5204
 6.393       17      0      1             0.4007    0.0629     0.2779    0.5204
 6.415       16      1      0             0.3757    0.0638     0.2527    0.4981
 6.639       15      0      1             0.3757    0.0638     0.2527    0.4981
  6.65       14      0      1             0.3757    0.0638     0.2527    0.4981
 6.656       13      0      1             0.3757    0.0638     0.2527    0.4981
  6.93       12      1      0             0.3443    0.0657     0.2200    0.4720
 6.946       11      1      0             0.3130    0.0668     0.1893    0.4447
 7.036       10      0      1             0.3130    0.0668     0.1893    0.4447
 7.099        9      0      1             0.3130    0.0668     0.1893    0.4447
 7.127        8      1      0             0.2739    0.0689     0.1503    0.4128
 7.565        7      0      1             0.2739    0.0689     0.1503    0.4128
 7.784        6      1      0             0.2283    0.0710     0.1074    0.3761
  8.32        5      0      1             0.2283    0.0710     0.1074    0.3761
 9.136        4      0      1             0.2283    0.0710     0.1074    0.3761
 9.213        3      0      1             0.2283    0.0710     0.1074    0.3761
 9.259        2      1      0             0.1141    0.0882     0.0128    0.3394
   9.5        1      0      1             0.1141    0.0882     0.0128    0.3394
treat=2 
 .0219       94      0      1             1.0000         .          .         .
 .0246       93      1      0             0.9892    0.0107     0.9261    0.9985
  .104       92      1      0             0.9785    0.0150     0.9167    0.9946
 .2628       91      1      0             0.9677    0.0183     0.9033    0.9895
 .3943       90      1      0             0.9570    0.0210     0.8895    0.9836
 .4572       89      1      0             0.9462    0.0234     0.8757    0.9773
 .4846       88      1      0             0.9355    0.0255     0.8620    0.9705
 .5229       87      0      1             0.9355    0.0255     0.8620    0.9705
 .5284       86      1      0             0.9246    0.0274     0.8483    0.9633
 .5503       85      1      0             0.9137    0.0292     0.8349    0.9559
  .564       84      1      0             0.9029    0.0308     0.8216    0.9482
 .6872       83      1      0             0.8920    0.0323     0.8085    0.9404
 .7858       82      0      1             0.8920    0.0323     0.8085    0.9404
 .9172       81      0      1             0.8920    0.0323     0.8085    0.9404
 1.038       80      0      1             0.8920    0.0323     0.8085    0.9404
 1.153       79      1      0             0.8807    0.0338     0.7949    0.9321
 1.164       78      1      0             0.8694    0.0352     0.7814    0.9237
  1.27       77      1      0             0.8581    0.0365     0.7681    0.9151
 1.363       76      0      1             0.8581    0.0365     0.7681    0.9151
 1.369       75      1      0             0.8467    0.0378     0.7547    0.9062
 1.572       74      0      1             0.8467    0.0378     0.7547    0.9062
 1.593       73      0      1             0.8467    0.0378     0.7547    0.9062
 1.604       72      1      0             0.8349    0.0390     0.7410    0.8971
 1.687       71      1      0             0.8231    0.0402     0.7274    0.8878
 1.725       70      1      0             0.8114    0.0413     0.7140    0.8784
 1.741       69      1      0             0.7996    0.0424     0.7007    0.8689
 1.771       68      1      0             0.7879    0.0433     0.6875    0.8592
 1.782       67      0      1             0.7879    0.0433     0.6875    0.8592
 1.884       66      1      0             0.7759    0.0443     0.6741    0.8494
 2.034       65      1      0             0.7640    0.0452     0.6609    0.8395
 2.062       64      1      0             0.7521    0.0460     0.6478    0.8294
 2.105       63      0      1             0.7521    0.0460     0.6478    0.8294
 2.182       62      1      0             0.7399    0.0469     0.6346    0.8192
 2.185       61      0      1             0.7399    0.0469     0.6346    0.8192
 2.201       60      1      0             0.7276    0.0477     0.6211    0.8087
 2.264       59      0      1             0.7276    0.0477     0.6211    0.8087
 2.475       58      0      1             0.7276    0.0477     0.6211    0.8087
 2.552       57      0      1             0.7276    0.0477     0.6211    0.8087
  2.59       56      1      0             0.7146    0.0486     0.6068    0.7977
 2.634       55      0      1             0.7146    0.0486     0.6068    0.7977
 2.667       54      1      0             0.7014    0.0494     0.5924    0.7864
 3.047       53      0      1             0.7014    0.0494     0.5924    0.7864
 3.337       52      1      0             0.6879    0.0503     0.5777    0.7748
 3.414       51      1      0             0.6744    0.0511     0.5631    0.7632
  3.45       50      1      0             0.6609    0.0518     0.5487    0.7514
 3.472       49      1      0             0.6474    0.0525     0.5344    0.7396
 3.537       48      0      1             0.6474    0.0525     0.5344    0.7396
 3.855       47      1      0             0.6336    0.0531     0.5199    0.7274
 3.932       46      0      1             0.6336    0.0531     0.5199    0.7274
 4.104       45      1      0             0.6196    0.0538     0.5051    0.7150
 4.107       44      1      0             0.6055    0.0544     0.4904    0.7024
 4.167       43      1      0             0.5914    0.0549     0.4758    0.6897
 4.249       42      1      0             0.5773    0.0554     0.4614    0.6769
 4.255       41      1      0             0.5632    0.0558     0.4471    0.6641
 4.257       40      0      1             0.5632    0.0558     0.4471    0.6641
 4.452       39      0      1             0.5632    0.0558     0.4471    0.6641
 4.515       38      0      1             0.5632    0.0558     0.4471    0.6641
 5.317       37      1      0             0.5480    0.0563     0.4314    0.6503
 5.407       36      1      0             0.5328    0.0568     0.4159    0.6364
 5.426       35      0      1             0.5328    0.0568     0.4159    0.6364
  5.47       34      0      1             0.5328    0.0568     0.4159    0.6364
 5.541       33      0      1             0.5328    0.0568     0.4159    0.6364
 5.634       32      0      1             0.5328    0.0568     0.4159    0.6364
 5.648       31      0      1             0.5328    0.0568     0.4159    0.6364
 5.752       30      0      1             0.5328    0.0568     0.4159    0.6364
 5.788       29      0      1             0.5328    0.0568     0.4159    0.6364
 5.881       28      1      0             0.5138    0.0578     0.3955    0.6199
 6.048       27      1      0             0.4947    0.0588     0.3755    0.6032
 6.171       26      0      1             0.4947    0.0588     0.3755    0.6032
 6.401       25      0      1             0.4947    0.0588     0.3755    0.6032
 6.527       24      0      1             0.4947    0.0588     0.3755    0.6032
 6.535       23      0      1             0.4947    0.0588     0.3755    0.6032
 6.612       22      0      1             0.4947    0.0588     0.3755    0.6032
 6.642       21      1      0             0.4712    0.0605     0.3495    0.5835
 6.669       20      0      1             0.4712    0.0605     0.3495    0.5835
 6.762       19      1      0             0.4464    0.0622     0.3225    0.5627
 6.831       18      0      1             0.4464    0.0622     0.3225    0.5627
 6.845       17      1      0             0.4201    0.0638     0.2945    0.5405
 6.905       16      1      0             0.3939    0.0650     0.2675    0.5177
 6.924       15      0      1             0.3939    0.0650     0.2675    0.5177
 7.513       14      0      1             0.3939    0.0650     0.2675    0.5177
 7.822       13      1      0             0.3636    0.0667     0.2361    0.4921
 8.019       12      1      0             0.3333    0.0677     0.2063    0.4654
 8.279       11      1      0             0.3030    0.0680     0.1781    0.4377
 8.367       10      0      1             0.3030    0.0680     0.1781    0.4377
  8.89        9      0      1             0.3030    0.0680     0.1781    0.4377
 9.029        8      0      1             0.3030    0.0680     0.1781    0.4377
 9.347        7      0      1             0.3030    0.0680     0.1781    0.4377
 9.462        6      0      1             0.3030    0.0680     0.1781    0.4377
 10.14        5      0      1             0.3030    0.0680     0.1781    0.4377
 10.69        4      0      1             0.3030    0.0680     0.1781    0.4377
 10.71        3      0      1             0.3030    0.0680     0.1781    0.4377
 11.25        2      0      1             0.3030    0.0680     0.1781    0.4377
 11.64        1      0      1             0.3030    0.0680     0.1781    0.4377
-------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts list if treat==2 & cir0==1

         failure _d:  d
   analysis time _t:  (dateout-origin)/365.25
             origin:  time datein

           Beg.          Net            Survivor      Std.
  Time    Total   Fail   Lost           Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
  .104       26      1      0             0.9615    0.0377     0.7569    0.9945
 .2628       25      1      0             0.9231    0.0523     0.7260    0.9802
 .4572       24      1      0             0.8846    0.0627     0.6836    0.9613
 .4846       23      1      0             0.8462    0.0708     0.6404    0.9393
 .9172       22      0      1             0.8462    0.0708     0.6404    0.9393
 1.164       21      1      0             0.8059    0.0780     0.5946    0.9143
 1.369       20      1      0             0.7656    0.0839     0.5505    0.8873
 1.572       19      0      1             0.7656    0.0839     0.5505    0.8873
 1.687       18      1      0             0.7230    0.0894     0.5044    0.8576
 1.725       17      1      0             0.6805    0.0937     0.4603    0.8262
 2.182       16      1      0             0.6380    0.0970     0.4180    0.7933
 2.201       15      1      0             0.5954    0.0994     0.3773    0.7590
 2.634       14      0      1             0.5954    0.0994     0.3773    0.7590
 2.667       13      1      0             0.5496    0.1018     0.3337    0.7215
 3.047       12      0      1             0.5496    0.1018     0.3337    0.7215
  3.45       11      1      0             0.4997    0.1041     0.2866    0.6803
 3.472       10      1      0             0.4497    0.1050     0.2425    0.6371
 3.855        9      1      0             0.3997    0.1045     0.2012    0.5920
 4.249        8      1      0             0.3498    0.1027     0.1625    0.5448
  5.47        7      0      1             0.3498    0.1027     0.1625    0.5448
 5.541        6      0      1             0.3498    0.1027     0.1625    0.5448
 6.762        5      1      0             0.2798    0.1033     0.1056    0.4859
 6.905        4      1      0             0.2099    0.0983     0.0601    0.4202
 8.019        3      1      0             0.1399    0.0869     0.0259    0.3469
  8.89        2      0      1             0.1399    0.0869     0.0259    0.3469
 11.25        1      0      1             0.1399    0.0869     0.0259    0.3469
-------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph, by(treat) cumhaz

         failure _d:  d
   analysis time _t:  (dateout-origin)/365.25
             origin:  time datein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts test treat, logrank

         failure _d:  d
   analysis time _t:  (dateout-origin)/365.25
             origin:  time datein


Log-rank test for equality of survivor functions

      |   Events         Events
treat |  observed       expected
------+-------------------------
1     |        49          45.33
2     |        47          50.67
------+-------------------------
Total |        96          96.00

            chi2(1) =       0.57
            Pr>chi2 =     0.4504

. 
end of do-file

. do "/tmp/SD09212.000000"

. use whitehall, clear
(Whitehall Study - 10% sample)

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, failure(chd) origin(timein) scale(365.25)

     failure event:  chd != 0 & chd < .
obs. time interval:  (origin, timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
        154  failures in single-record/single-failure data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts gragh
unknown sts subcommand gragh
r(198);

end of do-file

r(198);

. do "/tmp/SD09212.000000"

. sts graph

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph, by(sbpgrp)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts test sbpgrp, logrank

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein


Log-rank test for equality of survivor functions

       |   Events         Events
sbpgrp |  observed       expected
-------+-------------------------
1      |        28          36.81
2      |        44          62.90
3      |        43          37.09
4      |        39          17.20
-------+-------------------------
Total  |       154         154.00

             chi2(3) =      36.43
             Pr>chi2 =     0.0000

. 
end of do-file

. do "/tmp/SD09212.000000"

. use whitehall, clear
(Whitehall Study - 10% sample)

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, failure(chd) origin(timein) scale(365.25)

     failure event:  chd != 0 & chd < .
obs. time interval:  (origin, timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
        154  failures in single-record/single-failure data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, failure(chd) origin(timein) scale(365.25)

     failure event:  chd != 0 & chd < .
obs. time interval:  (origin, timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
        154  failures in single-record/single-failure data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
end of do-file

. do "/tmp/SD09212.000000"

. tab grade chd, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  grade of |
   work, 2 |    death from chd
    levels |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,104         90 |     1,194 
           |     92.46       7.54 |    100.00 
-----------+----------------------+----------
         2 |       419         64 |       483 
           |     86.75      13.25 |    100.00 
-----------+----------------------+----------
     Total |     1,523        154 |     1,677 
           |     90.82       9.18 |    100.00 


. 
end of do-file

. do "/tmp/SD09212.000000"

. table grade chd, c(median __t)
variable __t not found
r(111);

end of do-file

r(111);

. do "/tmp/SD09212.000000"

. table grade chd, c(median _t)

--------------------------------
grade of  |
work, 2   |    death from chd   
levels    |         0          1
----------+---------------------
        1 | 18.177918   11.91101
        2 | 17.872681  8.7679441
--------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph, by(grade) ci

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts list, by(grade) at(5 10 15)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

              Beg.                      Survivor      Std.
    Time     Total     Fail             Function     Error     [95% Conf. In
> t.]
----------------------------------------------------------------------------
> ---
grade=1 
       5      1170       10              0.9916    0.0026     0.9844    0.99
> 55
      10      1115       24              0.9709    0.0049     0.9596    0.97
> 91
      15      1046       30              0.9443    0.0068     0.9294    0.95
> 61
grade=2 
       5       446       17              0.9642    0.0085     0.9431    0.97
> 76
      10       384       22              0.9144    0.0131     0.8846    0.93
> 68
      15       335       16              0.8747    0.0159     0.8398    0.90
> 25
----------------------------------------------------------------------------
> ---
Note: Survivor function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts list, by(grade) at(5 10 15)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

              Beg.                      Survivor      Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
grade=1 
       5      1170       10              0.9916    0.0026     0.9844    0.9955
      10      1115       24              0.9709    0.0049     0.9596    0.9791
      15      1046       30              0.9443    0.0068     0.9294    0.9561
grade=2 
       5       446       17              0.9642    0.0085     0.9431    0.9776
      10       384       22              0.9144    0.0131     0.8846    0.9368
      15       335       16              0.8747    0.0159     0.8398    0.9025
-------------------------------------------------------------------------------
Note: Survivor function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts test grade

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein


Log-rank test for equality of survivor functions

      |   Events         Events
grade |  observed       expected
------+-------------------------
1     |        90         114.19
2     |        64          39.81
------+-------------------------
Total |       154         154.00

            chi2(1) =      19.85
            Pr>chi2 =     0.0000

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade, d(exp)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Iteration 0:   log likelihood = -627.95275  
Iteration 1:   log likelihood = -620.09818  
Iteration 2:   log likelihood = -619.57374  
Iteration 3:   log likelihood = -619.57209  
Iteration 4:   log likelihood = -619.57209  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(1)       =       16.76
Log likelihood  =   -619.57209                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.990735   .3255086     4.21   0.000      1.44488    2.742805
       _cons |   .0044248   .0004664   -51.42   0.000     .0035989    .0054403
------------------------------------------------------------------------------
Note: _cons estimates baseline hazard.

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade, d(exp) nohr

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Iteration 0:   log likelihood = -627.95275  
Iteration 1:   log likelihood = -620.09818  
Iteration 2:   log likelihood = -619.57374  
Iteration 3:   log likelihood = -619.57209  
Iteration 4:   log likelihood = -619.57209  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(1)       =       16.76
Log likelihood  =   -619.57209                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   .6885037   .1635118     4.21   0.000     .3680264    1.008981
       _cons |  -5.420525   .1054093   -51.42   0.000    -5.627123   -5.213926
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, origin(timebth) enter(timein) fail(chd) id(id) scale(365.25)

                id:  id
     failure event:  chd != 0 & chd < .
obs. time interval:  (timeout[_n-1], timeout]
 enter on or after:  time timein
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timebth

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
      1,677  subjects
        154  failures in single-failure-per-subject data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =    40.052
                                          last observed exit t =  85.76587

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade, d(exp)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timebth
  enter on or after:  time timein
                 id:  id

Iteration 0:   log likelihood = -307.80321  
Iteration 1:   log likelihood = -299.94865  
Iteration 2:   log likelihood =  -299.4242  
Iteration 3:   log likelihood = -299.42255  
Iteration 4:   log likelihood = -299.42255  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(1)       =       16.76
Log likelihood  =   -299.42255                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.990735   .3255086     4.21   0.000      1.44488    2.742805
       _cons |   .0044248   .0004664   -51.42   0.000     .0035989    .0054403
------------------------------------------------------------------------------
Note: _cons estimates baseline hazard.

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, failure(chd) origin(timein) scale(365.25)

     failure event:  chd != 0 & chd < .
obs. time interval:  (origin, timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
        154  failures in single-record/single-failure data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
end of do-file

. do "/tmp/SD09212.000000"

. gen agecat =1 if agein >= 40 & agein < 50
(955 missing values generated)

. 
end of do-file

. do "/tmp/SD09212.000000"

. replace agecat=2 if agein >= 50 & agein < 60
(702 real changes made)

. 
end of do-file

. drop agecat

. do "/tmp/SD09212.000000"

. gen agecat =1 if agein >= 40 & agein < 50
(955 missing values generated)

. 
end of do-file

. do "/tmp/SD09212.000000"

. replace agecat=2 if agein >= 50 & agein < 55
(362 real changes made)

. 
end of do-file

. do "/tmp/SD09212.000000"

. replace agecat=3 if agein >= 55 & agein < 60
(340 real changes made)

. 
end of do-file

. do "/tmp/SD09212.000000"

. replace agecat=4 if agein >= 60 & agein < 65
(215 real changes made)

. 
end of do-file

. do "/tmp/SD09212.000000"

. replace agecat=5 if agein >= 65 & agein < 70
(38 real changes made)

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat, d(exp)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Iteration 0:   log likelihood = -627.95275  
Iteration 1:   log likelihood = -598.83091  
Iteration 2:   log likelihood = -589.23241  
Iteration 3:   log likelihood = -588.94957  
Iteration 4:   log likelihood = -588.94892  
Iteration 5:   log likelihood = -588.94892  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(5)       =       78.01
Log likelihood  =   -588.94892                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.307487   .2295096     1.53   0.127     .9268762    1.844391
             |
      agecat |
          2  |   2.601128    .671538     3.70   0.000     1.568214    4.314376
          3  |     4.2471   1.026231     5.99   0.000     2.644939    6.819761
          4  |   4.406814   1.192743     5.48   0.000     2.592624    7.490486
          5  |   11.09006   4.157305     6.42   0.000     5.319194    23.12181
             |
       _cons |    .002014    .000394   -31.73   0.000     .0013726    .0029553
------------------------------------------------------------------------------
Note: _cons estimates baseline hazard.

. 
end of do-file

. do "/tmp/SD09212.000000"

. tab agecat grade , col chi

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   grade of work, 2
           |        levels
    agecat |         1          2 |     Total
-----------+----------------------+----------
         1 |       603        119 |       722 
           |     50.50      24.64 |     43.05 
-----------+----------------------+----------
         2 |       273         89 |       362 
           |     22.86      18.43 |     21.59 
-----------+----------------------+----------
         3 |       215        125 |       340 
           |     18.01      25.88 |     20.27 
-----------+----------------------+----------
         4 |        96        119 |       215 
           |      8.04      24.64 |     12.82 
-----------+----------------------+----------
         5 |         7         31 |        38 
           |      0.59       6.42 |      2.27 
-----------+----------------------+----------
     Total |     1,194        483 |     1,677 
           |    100.00     100.00 |    100.00 

          Pearson chi2(4) = 192.5970   Pr = 0.000

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat, d(weib)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Fitting constant-only model:

Iteration 0:   log likelihood = -627.95275
Iteration 1:   log likelihood = -621.65709
Iteration 2:   log likelihood = -621.54148
Iteration 3:   log likelihood = -621.54144

Fitting full model:

Iteration 0:   log likelihood = -621.54144  
Iteration 1:   log likelihood = -591.43979  
Iteration 2:   log likelihood = -580.27283  
Iteration 3:   log likelihood =  -579.9356  
Iteration 4:   log likelihood = -579.93477  
Iteration 5:   log likelihood = -579.93477  

Weibull PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(5)       =       83.21
Log likelihood  =   -579.93477                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.330335   .2333216     1.63   0.104     .9433496    1.876072
             |
      agecat |
          2  |   2.635525   .6804051     3.75   0.000     1.588968    4.371386
          3  |   4.366753   1.055241     6.10   0.000     2.719336    7.012201
          4  |   4.592551   1.243511     5.63   0.000     2.701325    7.807845
          5  |   12.75834   4.795906     6.77   0.000     6.106952    26.65409
             |
       _cons |   .0006074   .0002251   -19.99   0.000     .0002938    .0012557
-------------+----------------------------------------------------------------
       /ln_p |   .3462011   .0767777     4.51   0.000     .1957195    .4966827
-------------+----------------------------------------------------------------
           p |   1.413687   .1085397                      1.216186    1.643261
         1/p |   .7073702   .0543103                      .6085461    .8222428
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.
Note: _cons estimates baseline hazard.

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph if agecat == 1, by(grade) cumhaz yscale(log) xscale(log) ci title(Age: 40-50)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph if agecat == 2, by(grade) cumhaz yscale(log) xscale(log) ci title(Age: 50-55)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph if agecat == 2, by(grade) cumhaz yscale(log) xscale(log) ci title(Age: 50-55)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph if agecat == 1, by(grade) cumhaz yscale(log) xscale(log) ci title(Age: 40-50)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

. 
end of do-file

. do "/tmp/SD09212.000000"

. sts graph if agecat == 2, by(grade) cumhaz yscale(log) xscale(log) ci title(Age: 50-55)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat, d(exp)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Iteration 0:   log likelihood = -627.95275  
Iteration 1:   log likelihood = -598.83091  
Iteration 2:   log likelihood = -589.23241  
Iteration 3:   log likelihood = -588.94957  
Iteration 4:   log likelihood = -588.94892  
Iteration 5:   log likelihood = -588.94892  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(5)       =       78.01
Log likelihood  =   -588.94892                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.307487   .2295096     1.53   0.127     .9268762    1.844391
             |
      agecat |
          2  |   2.601128    .671538     3.70   0.000     1.568214    4.314376
          3  |     4.2471   1.026231     5.99   0.000     2.644939    6.819761
          4  |   4.406814   1.192743     5.48   0.000     2.592624    7.490486
          5  |   11.09006   4.157305     6.42   0.000     5.319194    23.12181
             |
       _cons |    .002014    .000394   -31.73   0.000     .0013726    .0029553
------------------------------------------------------------------------------
Note: _cons estimates baseline hazard.

. estimates store A

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat, d(weib)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Fitting constant-only model:

Iteration 0:   log likelihood = -627.95275
Iteration 1:   log likelihood = -621.65709
Iteration 2:   log likelihood = -621.54148
Iteration 3:   log likelihood = -621.54144

Fitting full model:

Iteration 0:   log likelihood = -621.54144  
Iteration 1:   log likelihood = -591.43979  
Iteration 2:   log likelihood = -580.27283  
Iteration 3:   log likelihood =  -579.9356  
Iteration 4:   log likelihood = -579.93477  
Iteration 5:   log likelihood = -579.93477  

Weibull PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(5)       =       83.21
Log likelihood  =   -579.93477                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.330335   .2333216     1.63   0.104     .9433496    1.876072
             |
      agecat |
          2  |   2.635525   .6804051     3.75   0.000     1.588968    4.371386
          3  |   4.366753   1.055241     6.10   0.000     2.719336    7.012201
          4  |   4.592551   1.243511     5.63   0.000     2.701325    7.807845
          5  |   12.75834   4.795906     6.77   0.000     6.106952    26.65409
             |
       _cons |   .0006074   .0002251   -19.99   0.000     .0002938    .0012557
-------------+----------------------------------------------------------------
       /ln_p |   .3462011   .0767777     4.51   0.000     .1957195    .4966827
-------------+----------------------------------------------------------------
           p |   1.413687   .1085397                      1.216186    1.643261
         1/p |   .7073702   .0543103                      .6085461    .8222428
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.
Note: _cons estimates baseline hazard.

. estimates store B

. 
end of do-file

. do "/tmp/SD09212.000000"

. lrtest A B
test involves different estimators: weibull vs. ereg
r(498);

end of do-file

r(498);

. do "/tmp/SD09212.000000"

. lrtest A B, force

Likelihood-ratio test                                 LR chi2(1)  =     18.03
(Assumption: A nested in B)                           Prob > chi2 =    0.0000

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, failure(chd) origin(timein) id(id) scale(365.25)

                id:  id
     failure event:  chd != 0 & chd < .
obs. time interval:  (timeout[_n-1], timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
      1,677  subjects
        154  failures in single-failure-per-subject data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
end of do-file

. do "/tmp/SD09212.000000"

. list id _t0 _t _d if id == 5001

      +-----------------------------+
      |   id   _t0          _t   _d |
      |-----------------------------|
   1. | 5001     0   19.381226    0 |
      +-----------------------------+

. 
end of do-file

. do "/tmp/SD09212.000000"

. list id _t0 _t _d if id == 5350

      +-----------------------------+
      |   id   _t0          _t   _d |
      |-----------------------------|
  44. | 5350     0   12.810425    1 |
      +-----------------------------+

. 
end of do-file

. do "/tmp/SD09212.000000"

. stsplit fuband, at(0, 5, 10, 15, 20)
(4,490 observations (episodes) created)

. 
end of do-file

. do "/tmp/SD09212.000000"

. list id _t0 _t _d if id == 5001

      +-----------------------------+
      |   id   _t0          _t   _d |
      |-----------------------------|
   1. | 5001     0           5    0 |
   2. | 5001     5          10    0 |
   3. | 5001    10          15    0 |
   4. | 5001    15   19.381226    0 |
      +-----------------------------+

. 
end of do-file

. do "/tmp/SD09212.000000"

. list id _t0 _t _d if id == 5350

      +-----------------------------+
      |   id   _t0          _t   _d |
      |-----------------------------|
 168. | 5350     0           5    0 |
 169. | 5350     5          10    0 |
 170. | 5350    10   12.810425    1 |
      +-----------------------------+

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat i.fuband, d(exp)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein
                 id:  id

Iteration 0:   log likelihood = -627.95275  
Iteration 1:   log likelihood =  -591.9306  
Iteration 2:   log likelihood = -579.41276  
Iteration 3:   log likelihood = -578.95461  
Iteration 4:   log likelihood = -578.95308  
Iteration 5:   log likelihood = -578.95308  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       6,167
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(8)       =       98.00
Log likelihood  =   -578.95308                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.331225   .2334661     1.63   0.103     .9439961    1.877295
             |
      agecat |
          2  |   2.640372    .681673     3.76   0.000     1.591871    4.379479
          3  |    4.38278   1.059289     6.11   0.000     2.729103    7.038489
          4  |   4.616894   1.250461     5.65   0.000      2.71523    7.850427
          5  |   12.96442   4.881605     6.80   0.000     6.197877    27.11836
             |
      fuband |
          5  |   1.875335   .4547992     2.59   0.010     1.165866     3.01654
         10  |   2.189782   .5324741     3.22   0.001     1.359628    3.526807
         15  |    2.92785   .7547583     4.17   0.000      1.76653    4.852623
             |
       _cons |   .0010588   .0002829   -25.64   0.000     .0006271    .0017875
------------------------------------------------------------------------------
Note: _cons estimates baseline hazard.

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, failure(chd) origin(timein) scale(365.25)

     failure event:  chd != 0 & chd < .
obs. time interval:  (origin, timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      6,167  total observations
          0  exclusions
------------------------------------------------------------------------------
      6,167  observations remaining, representing
        154  failures in single-record/single-failure data
  71,330.37  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade, d(exp) nohr

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Iteration 0:   log likelihood = -774.14678  
Iteration 1:   log likelihood = -765.64943  
Iteration 2:   log likelihood = -764.99489  
Iteration 3:   log likelihood = -764.99292  
Iteration 4:   log likelihood = -764.99292  

Exponential PH regression

No. of subjects =        6,167                  Number of obs    =       6,167
No. of failures =          154
Time at risk    =  71330.37041
                                                LR chi2(1)       =       18.31
Log likelihood  =   -764.99292                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   .7207904   .1635118     4.41   0.000     .4003132    1.041268
       _cons |  -6.378234   .1054093   -60.51   0.000    -6.584832   -6.171635
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. 
. use whitehall, clear
(Whitehall Study - 10% sample)

. 
. stset timeout, failure(chd) origin(timein) scale(365.25)

     failure event:  chd != 0 & chd < .
obs. time interval:  (origin, timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
        154  failures in single-record/single-failure data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade, d(exp) nohr

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Iteration 0:   log likelihood = -627.95275  
Iteration 1:   log likelihood = -620.09818  
Iteration 2:   log likelihood = -619.57374  
Iteration 3:   log likelihood = -619.57209  
Iteration 4:   log likelihood = -619.57209  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(1)       =       16.76
Log likelihood  =   -619.57209                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   .6885037   .1635118     4.21   0.000     .3680264    1.008981
       _cons |  -5.420525   .1054093   -51.42   0.000    -5.627123   -5.213926
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, origin(timebth) enter(timein) fail(chd) id(id) scale(365.25)

                id:  id
     failure event:  chd != 0 & chd < .
obs. time interval:  (timeout[_n-1], timeout]
 enter on or after:  time timein
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timebth

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
      1,677  subjects
        154  failures in single-failure-per-subject data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =    40.052
                                          last observed exit t =  85.76587

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade, d(exp)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timebth
  enter on or after:  time timein
                 id:  id

Iteration 0:   log likelihood = -307.80321  
Iteration 1:   log likelihood = -299.94865  
Iteration 2:   log likelihood =  -299.4242  
Iteration 3:   log likelihood = -299.42255  
Iteration 4:   log likelihood = -299.42255  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(1)       =       16.76
Log likelihood  =   -299.42255                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.990735   .3255086     4.21   0.000      1.44488    2.742805
       _cons |   .0044248   .0004664   -51.42   0.000     .0035989    .0054403
------------------------------------------------------------------------------
Note: _cons estimates baseline hazard.

. 
end of do-file

. do "/tmp/SD09212.000000"

. stset timeout, failure(chd) origin(timein) scale(365.25)

     failure event:  chd != 0 & chd < .
obs. time interval:  (origin, timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
        154  failures in single-record/single-failure data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat, d(weib)
variable agecat not found
r(111);

end of do-file

r(111);

. do "/tmp/SD09212.000000"

. gen agecat =1 if agein >= 40 & agein < 50
(955 missing values generated)

. replace agecat=2 if agein >= 50 & agein < 55
(362 real changes made)

. replace agecat=3 if agein >= 55 & agein < 60
(340 real changes made)

. replace agecat=4 if agein >= 60 & agein < 65
(215 real changes made)

. replace agecat=5 if agein >= 65 & agein < 70
(38 real changes made)

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat, d(weib)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Fitting constant-only model:

Iteration 0:   log likelihood = -627.95275
Iteration 1:   log likelihood = -621.65709
Iteration 2:   log likelihood = -621.54148
Iteration 3:   log likelihood = -621.54144

Fitting full model:

Iteration 0:   log likelihood = -621.54144  
Iteration 1:   log likelihood = -591.43979  
Iteration 2:   log likelihood = -580.27283  
Iteration 3:   log likelihood =  -579.9356  
Iteration 4:   log likelihood = -579.93477  
Iteration 5:   log likelihood = -579.93477  

Weibull PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(5)       =       83.21
Log likelihood  =   -579.93477                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.330335   .2333216     1.63   0.104     .9433496    1.876072
             |
      agecat |
          2  |   2.635525   .6804051     3.75   0.000     1.588968    4.371386
          3  |   4.366753   1.055241     6.10   0.000     2.719336    7.012201
          4  |   4.592551   1.243511     5.63   0.000     2.701325    7.807845
          5  |   12.75834   4.795906     6.77   0.000     6.106952    26.65409
             |
       _cons |   .0006074   .0002251   -19.99   0.000     .0002938    .0012557
-------------+----------------------------------------------------------------
       /ln_p |   .3462011   .0767777     4.51   0.000     .1957195    .4966827
-------------+----------------------------------------------------------------
           p |   1.413687   .1085397                      1.216186    1.643261
         1/p |   .7073702   .0543103                      .6085461    .8222428
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.
Note: _cons estimates baseline hazard.

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat, d(weib) nohr

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein

Fitting constant-only model:

Iteration 0:   log likelihood = -627.95275
Iteration 1:   log likelihood = -621.65709
Iteration 2:   log likelihood = -621.54148
Iteration 3:   log likelihood = -621.54144

Fitting full model:

Iteration 0:   log likelihood = -621.54144  
Iteration 1:   log likelihood = -591.43979  
Iteration 2:   log likelihood = -580.27283  
Iteration 3:   log likelihood =  -579.9356  
Iteration 4:   log likelihood = -579.93477  
Iteration 5:   log likelihood = -579.93477  

Weibull PH regression

No. of subjects =        1,677                  Number of obs    =       1,677
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(5)       =       83.21
Log likelihood  =   -579.93477                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |    .285431   .1753856     1.63   0.104    -.0583184    .6291805
             |
      agecat |
          2  |   .9690825   .2581668     3.75   0.000      .463085     1.47508
          3  |    1.47402   .2416534     6.10   0.000     1.000388    1.947652
          4  |   1.524436   .2707669     5.63   0.000     .9937422    2.055129
          5  |   2.546185   .3759036     6.77   0.000     1.809428    3.282943
             |
       _cons |  -7.406372   .3705694   -19.99   0.000    -8.132675   -6.680069
-------------+----------------------------------------------------------------
       /ln_p |   .3462011   .0767777     4.51   0.000     .1957195    .4966827
-------------+----------------------------------------------------------------
           p |   1.413687   .1085397                      1.216186    1.643261
         1/p |   .7073702   .0543103                      .6085461    .8222428
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. 
. stset timeout, failure(chd) origin(timein) id(id) scale(365.25)

                id:  id
     failure event:  chd != 0 & chd < .
obs. time interval:  (timeout[_n-1], timeout]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time timein

------------------------------------------------------------------------------
      1,677  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,677  observations remaining, representing
      1,677  subjects
        154  failures in single-failure-per-subject data
 27,605.371  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  19.38123

. 
. list id _t0 _t _d if id == 5001

      +-----------------------------+
      |   id   _t0          _t   _d |
      |-----------------------------|
   1. | 5001     0   19.381226    0 |
      +-----------------------------+

. list id _t0 _t _d if id == 5350

      +-----------------------------+
      |   id   _t0          _t   _d |
      |-----------------------------|
  44. | 5350     0   12.810425    1 |
      +-----------------------------+

. stsplit fuband, at(0, 5, 10, 15, 20)
(4,490 observations (episodes) created)

. list id _t0 _t _d if id == 5001

      +-----------------------------+
      |   id   _t0          _t   _d |
      |-----------------------------|
   1. | 5001     0           5    0 |
   2. | 5001     5          10    0 |
   3. | 5001    10          15    0 |
   4. | 5001    15   19.381226    0 |
      +-----------------------------+

. list id _t0 _t _d if id == 5350

      +-----------------------------+
      |   id   _t0          _t   _d |
      |-----------------------------|
 168. | 5350     0           5    0 |
 169. | 5350     5          10    0 |
 170. | 5350    10   12.810425    1 |
      +-----------------------------+

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat i.fuband, d(exp)

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein
                 id:  id

Iteration 0:   log likelihood = -627.95275  
Iteration 1:   log likelihood =  -591.9306  
Iteration 2:   log likelihood = -579.41276  
Iteration 3:   log likelihood = -578.95461  
Iteration 4:   log likelihood = -578.95308  
Iteration 5:   log likelihood = -578.95308  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       6,167
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(8)       =       98.00
Log likelihood  =   -578.95308                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.331225   .2334661     1.63   0.103     .9439961    1.877295
             |
      agecat |
          2  |   2.640372    .681673     3.76   0.000     1.591871    4.379479
          3  |    4.38278   1.059289     6.11   0.000     2.729103    7.038489
          4  |   4.616894   1.250461     5.65   0.000      2.71523    7.850427
          5  |   12.96442   4.881605     6.80   0.000     6.197877    27.11836
             |
      fuband |
          5  |   1.875335   .4547992     2.59   0.010     1.165866     3.01654
         10  |   2.189782   .5324741     3.22   0.001     1.359628    3.526807
         15  |    2.92785   .7547583     4.17   0.000      1.76653    4.852623
             |
       _cons |   .0010588   .0002829   -25.64   0.000     .0006271    .0017875
------------------------------------------------------------------------------
Note: _cons estimates baseline hazard.

. 
end of do-file

. do "/tmp/SD09212.000000"

. streg i.grade i.agecat i.fuband, d(exp) nohr

         failure _d:  chd
   analysis time _t:  (timeout-origin)/365.25
             origin:  time timein
                 id:  id

Iteration 0:   log likelihood = -627.95275  
Iteration 1:   log likelihood =  -591.9306  
Iteration 2:   log likelihood = -579.41276  
Iteration 3:   log likelihood = -578.95461  
Iteration 4:   log likelihood = -578.95308  
Iteration 5:   log likelihood = -578.95308  

Exponential PH regression

No. of subjects =        1,677                  Number of obs    =       6,167
No. of failures =          154
Time at risk    =  27605.37066
                                                LR chi2(8)       =       98.00
Log likelihood  =   -578.95308                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   .2860993   .1753769     1.63   0.103    -.0576332    .6298318
             |
      agecat |
          2  |   .9709199   .2581731     3.76   0.000       .46491     1.47693
          3  |   1.477683   .2416934     6.11   0.000     1.003973    1.951394
          4  |   1.529722   .2708446     5.65   0.000     .9988766    2.060568
          5  |   2.562209   .3765385     6.80   0.000     1.824207    3.300211
             |
      fuband |
          5  |   .6287874   .2425162     2.59   0.010     .1534643     1.10411
         10  |   .7838021   .2431631     3.22   0.001     .3072113    1.260393
         15  |   1.074268   .2577859     4.17   0.000     .5690172    1.579519
             |
       _cons |  -6.850631   .2672022   -25.64   0.000    -7.374338   -6.326925
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. poisson chd i.grade, exp(_t)

Iteration 0:   log likelihood =  -619.5724  
Iteration 1:   log likelihood = -619.57209  
Iteration 2:   log likelihood = -619.57209  

Poisson regression                              Number of obs     =      1,677
                                                LR chi2(1)        =      16.76
                                                Prob > chi2       =     0.0000
Log likelihood = -619.57209                     Pseudo R2         =     0.0133

------------------------------------------------------------------------------
         chd |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   .6885037   .1635118     4.21   0.000     .3680264    1.008981
       _cons |  -5.420525   .1054093   -51.42   0.000    -5.627123   -5.213926
      ln(_t) |          1  (exposure)
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD09212.000000"

. poisson chd i.grade, exp(_t) irr

Iteration 0:   log likelihood =  -619.5724  
Iteration 1:   log likelihood = -619.57209  
Iteration 2:   log likelihood = -619.57209  

Poisson regression                              Number of obs     =      1,677
                                                LR chi2(1)        =      16.76
                                                Prob > chi2       =     0.0000
Log likelihood = -619.57209                     Pseudo R2         =     0.0133

------------------------------------------------------------------------------
         chd |        IRR   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     2.grade |   1.990735   .3255086     4.21   0.000      1.44488    2.742805
       _cons |   .0044248   .0004664   -51.42   0.000     .0035989    .0054403
      ln(_t) |          1  (exposure)
------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate.

. 
end of do-file

. do "/tmp/SD09212.000000"

. log closing
closing invalid
r(198);

end of do-file

r(198);

. do "/tmp/SD09212.000000"

. log close
      name:  <unnamed>
       log:  /home/ccwang/Documents/LSHTMlearningnote/backupfiles/LSHTMstata.log
  log type:  text
 closed on:  25 Apr 2018, 21:31:30
----------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/ccwang/Documents/LSHTMlearningnote/backupfiles/LSHTMstata.log
  log type:  text
 opened on:  25 Apr 2018, 21:44:47

. 
end of do-file

--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/ccwang/Documents/LSHTMlearningnote/backupfiles/LSHTMstata.log
  log type:  text
 opened on:  26 Apr 2018, 19:37:07

. 
end of do-file

. 
. 
. do "/tmp/SD04886.000000"

. use cattaneo
file cattaneo.dta not found
r(601);

end of do-file

r(601);

. do "/tmp/SD04886.000000"

. use cattaneo2
(Excerpt from Cattaneo (2010) Journal of Econometrics 155: 138-154)

. 
end of do-file

. do "/tmp/SD04886.000000"

. browse

. 
end of do-file

. do "/tmp/SD04886.000000"

. regress bweight i.mbsmoke mage i.fbaby i.prenatal

      Source |       SS           df       MS      Number of obs   =     4,642
-------------+----------------------------------   F(6, 4635)      =     47.91
       Model |  90805012.9         6  15134168.8   Prob > F        =    0.0000
    Residual |  1.4641e+09     4,635  315874.698   R-squared       =    0.0584
-------------+----------------------------------   Adj R-squared   =    0.0572
       Total |  1.5549e+09     4,641  335032.156   Root MSE        =    562.03

------------------------------------------------------------------------------
     bweight |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     mbsmoke |
     smoker  |  -252.2599   21.56769   -11.70   0.000    -294.5428    -209.977
        mage |   5.268133   1.614634     3.26   0.001     2.102682    8.433583
             |
       fbaby |
        Yes  |   -59.9184   17.70037    -3.39   0.001    -94.61955   -25.21725
             |
    prenatal |
          1  |   578.8464   68.50775     8.45   0.000     444.5386    713.1542
          2  |    534.228   70.60317     7.57   0.000     395.8122    672.6439
          3  |   458.5222   80.99918     5.66   0.000     299.7252    617.3191
             |
       _cons |   2735.844   78.22597    34.97   0.000     2582.484    2889.204
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD04886.000000"

. gen mage2=mage^2

. 
end of do-file

. do "/tmp/SD04886.000000"

. regress bweight i.mbsmoke mage mage2 i.fbaby##i.prenatal

      Source |       SS           df       MS      Number of obs   =     4,642
-------------+----------------------------------   F(10, 4631)     =     30.71
       Model |  96694257.3        10  9669425.73   Prob > F        =    0.0000
    Residual |  1.4582e+09     4,631  314875.832   R-squared       =    0.0622
-------------+----------------------------------   Adj R-squared   =    0.0602
       Total |  1.5549e+09     4,641  335032.156   Root MSE        =    561.14

--------------------------------------------------------------------------------
       bweight |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
       mbsmoke |
       smoker  |  -251.5405   21.58407   -11.65   0.000    -293.8555   -209.2254
          mage |   32.66383   11.70667     2.79   0.005      9.71319    55.61447
         mage2 |  -.5057489   .2129409    -2.38   0.018    -.9232146   -.0882833
               |
         fbaby |
          Yes  |   409.5545   153.9108     2.66   0.008     107.8159     711.293
               |
      prenatal |
            1  |   689.1136   79.41616     8.68   0.000     533.4201    844.8071
            2  |   684.6145   82.81672     8.27   0.000     522.2543    846.9747
            3  |   555.0691   95.65524     5.80   0.000     367.5392    742.5989
               |
fbaby#prenatal |
        Yes#1  |  -460.2708   154.7929    -2.97   0.003    -763.7386    -156.803
        Yes#2  |  -538.8538   159.4242    -3.38   0.001    -851.4012   -226.3065
        Yes#3  |    -393.85   180.5062    -2.18   0.029    -747.7281    -39.9719
               |
         _cons |   2265.099   174.1151    13.01   0.000     1923.751    2606.448
--------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD04886.000000"

. regress bweight i.mbsmoke##i.fbaby i.prenatal mage mage2

      Source |       SS           df       MS      Number of obs   =     4,642
-------------+----------------------------------   F(8, 4633)      =     37.93
       Model |  95584969.9         8  11948121.2   Prob > F        =    0.0000
    Residual |  1.4593e+09     4,633  314979.337   R-squared       =    0.0615
-------------+----------------------------------   Adj R-squared   =    0.0599
       Total |  1.5549e+09     4,641  335032.156   Root MSE        =    561.23

-------------------------------------------------------------------------------
      bweight |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
      mbsmoke |
      smoker  |  -304.7073   27.49473   -11.08   0.000      -358.61   -250.8045
              |
        fbaby |
         Yes  |  -77.54831   19.35568    -4.01   0.000    -115.4947   -39.60196
              |
mbsmoke#fbaby |
  smoker#Yes  |   132.7836    43.7377     3.04   0.002     47.03694    218.5304
              |
     prenatal |
           1  |   559.6443   68.58918     8.16   0.000     425.1768    694.1117
           2  |   525.3199   70.55368     7.45   0.000     387.0011    663.6387
           3  |   455.2679   80.89765     5.63   0.000       296.67    613.8658
              |
         mage |   35.28829   11.62801     3.03   0.002     12.49186    58.08472
        mage2 |  -.5519203    .211685    -2.61   0.009    -.9669237   -.1369168
        _cons |    2370.45   167.1305    14.18   0.000     2042.795    2698.105
-------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD04886.000000"

. teffects ra (bweight mage mage2) (mbsmoke)

Iteration 0:   EE criterion =  9.667e-23  
Iteration 1:   EE criterion =  7.554e-27  

Treatment-effects estimation                    Number of obs     =      4,642
Estimator      : regression adjustment
Outcome model  : linear
Treatment model: none
----------------------------------------------------------------------------------------
                       |               Robust
               bweight |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
ATE                    |
               mbsmoke |
(smoker vs nonsmoker)  |  -275.9901   22.74918   -12.13   0.000    -320.5777   -231.4025
-----------------------+----------------------------------------------------------------
POmean                 |
               mbsmoke |
            nonsmoker  |   3409.482   9.284654   367.22   0.000     3391.284    3427.679
----------------------------------------------------------------------------------------

. 
end of do-file

. help tefefcts ra

. help teffects

